#написан andreyd22  dmitrichev@gmail.com при пинках Паши Голубева golubev.pavel@gmail.com
require 'rubygems'
require 'hpricot'
require 'open-uri'
require File.dirname(__FILE__) + '/../lib/sequel_adapter.rb'


class AculaOrg
  
  CATEGORIES = {
  "Business Consulting" => 'Прочее',
  "Бизнес-планы" => 'Прочее',
  "Бухгалтерия" => 'Прочее',
  "Инвестиционные проекты" => 'Прочее',
  "Тренинги" => 'Прочее',
  "Управление персоналом" => 'Прочее',
  "Управление проектами" => 'Прочее',
  "Юриспруденция" => 'Прочее',
  "Web дизайн / Internet маркетинг / SEO" => 'Прочее',
  "Internet маркетинг" => 'Прочее',
  "SEO" => 'Прочее',
  "Верстка" => 'Прочее',
  "Дизайн web сайтов" => 'Прочее',
  "Дизайн баннеров" => 'Прочее',
  "Контекстная реклама" => 'Прочее',
  "Контент менеджер" => 'Прочее',
  "Флеш-сайты / флеш-графика" => 'Прочее',
  "Администрирование / Техподдержка" => 'Прочее',
  "Администрирование серверов" => 'Прочее',
  "Настройка аппаратного обеспечения" => 'Прочее',
  "Техническая поддержка / Консультирование" => 'Прочее',
  "Установка ПО" => 'Прочее',
  "Графический дизайн / презентации / мультимедиа" => 'Прочее',
  "2D моделирование / 2D анимация" => 'Прочее',
  "3D моделирование / 3D анимация" => 'Прочее',
  "Flash презентации" => 'Прочее',
  "Hаружная реклама" => 'Прочее',
  "PowerPoint презентации" => 'Прочее',
  "Векторная графика" => 'Прочее',
  "Видео презентации" => 'Прочее',
  "Дизайн интерфейсов" => 'Прочее',
  "Дизайн интерьеров" => 'Прочее',
  "Дизайн упаковки" => 'Прочее',
  "Иконки" => 'Прочее',
  "Индустриальный дизайн" => 'Прочее',
  "Комиксы" => 'Прочее',
  "Ландшафтный дизайн" => 'Прочее',
  "Логотипы" => 'Прочее',
  "Полиграфическая верстка" => 'Прочее',
  "Полиграфия" => 'Прочее',
  "Разработка шрифтов" => 'Прочее',
  "Ретуширование фотографий" => 'Прочее',
  "Фирменный стиль" => 'Прочее',
  "Экстерьеры" => 'Прочее',
  "Искусство" => 'Прочее',
  "Графика" => 'Прочее',
  "Живопись" => 'Прочее',
  "Музыка" => 'Прочее',
  "Скульптура" => 'Прочее',
  "Переводы / Тексты / Копирайтинг" => 'Прочее',
  "Web контент" => 'Прочее',
  "Документация" => 'Прочее',
  "Копирайтинг / Редактирование" => 'Прочее',
  "Новости / Статьи / Пресс-релизы" => 'Прочее',
  "Рекламные тексты" => 'Прочее',
  "Рефераты / Курсовые и Дипломные работы" => 'Прочее',
  "Стихи / проза" => 'Прочее',
  "Технические переводы" => 'Прочее',
  "Художественные переводы" => 'Прочее',
  "Программирование / Web пр. / ПО / Разработка БД" => 'Прочее',
  "1С-программирование" => 'Прочее',
  "PDA" => 'Прочее',
  "QA и тестирование ПО" => 'Прочее',
  "Web программирование" => 'Прочее',
  "Web-сайты &quot;под ключ&quot;" => 'Прочее',
  "Архитектура ПО" => 'Прочее',
  "Встраиваемые системы" => 'Прочее',
  "Другие технологии" => 'Прочее',
  "ПО для мобильных телефонов и КПК" => 'Прочее',
  "Прикладное программирование" => 'Прочее',
  "Разработка баз данных и администрирование" => 'Прочее',
  "Разработка игр" => 'Прочее',
  "Системное программирование" => 'Прочее',
  "Проектирование / CAD / Архитектура" => 'Прочее',
  "CAD / AutoCad" => 'Прочее',
  "Архитектура" => 'Прочее',
  "Индустриальное проектирование" => 'Прочее',
  "Реклама / Маркетинг / Обработка инф." => 'Прочее',
  "Реклама / Маркетинг / Обработка инф." => 'Прочее',
  "Branding" => 'Прочее',
  "Product/Brand менеджмент" => 'Прочее',
  "Public Relations Management (PR)" => 'Прочее',
  "Маркетинговые и Консалтинговые исследования" => 'Прочее',
  "Рекламные кампании" => 'Прочее',
  "Сбор информации/Обработка информации" => 'Прочее',
  "Фотография" => 'Прочее',
  "Мероприятия / Репортажи" => 'Прочее',
  "Модели" => 'Прочее',
  "Ретуширование / Коллажи" => 'Прочее',
  "Свадебные фото" => 'Прочее'
  }

  CURRENCIES = { 'RUB' => "руб.", "USD" => '$', 'EUR' => '€', "FM" => 'FM' }

  def self.desc
    'acula.org'
  end

  def self.latest
    self.rss
  end

  def self.rss
    doc = Hpricot.XML(open('http://acula.org/feed/newprojects.xml'))
    args = {}
    resultset = []
    (doc/:item).each do |project_div|
      args = {}
      args[:title] = convert((project_div/:title).inner_html)
      args[:url] = convert((project_div/:link).inner_html)
      args[:remote_id] = args[:url].gsub(/[^\d]/, '')
      desc = convert((project_div/:description).inner_html)
      desc2 =  desc.sub(/^(.+?)\n/i,"")
      args[:desc] = desc2.gsub(/&lt;([^&gt;]+)&gt;/i,"").gsub(/&lt;\/([^&gt;]+)&gt;/i,"").gsub(/\&\#xD\;/i,"")
      #args[:desc] = desc2.gsub(/<([^>]+)>/i,"").gsub(/<\/([^>]+)>/i,"").gsub(/\&\#xD\;/i,"")
      
      budjet = desc.match(/Максимальный бюджет\&lt\;\/strong\&gt\;\: (\d+) (EUR|USD|RUB)/i)[1]
      currency = desc.match(/Максимальный бюджет\&lt\;\/strong\&gt\;\: (\d+) (EUR|USD|RUB)/i)[2]
      begin
        category = convert((project_div/:category).inner_html)
        if CATEGORIES[category]
          args[:category_id] = DB["select id from categories where title ilike E'%#{CATEGORIES[category]}%'"].first[:id]

        end
      rescue Exception => e
        puts e

      end


      args[:created_at] = Time.now
      args[:budjet] = budjet
      args[:currency] = CURRENCIES[currency]
      if args[:budjet].to_f == 0.0
        args[:budjet] = nil
        args[:currency] = nil
      end

      resultset << args
    end
    resultset.reverse
  end

  def self.convert(s)
    s.force_encoding('UTF-8').to_s
  end
end
